---
kind: other
id: Methods.T:Autodesk.Revit.DB.PlanTopologySet
source: html/7b2133e5-c8a7-a52e-6b84-1f2ad7cb4dae.htm
---
# PlanTopologySet Methods

Removes every item from the set, rendering it empty.